Hi I think that depends on expicitly resolved it
```
------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lex_bot.book_trip will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_bot" "book_trip"  {
      + arn                             = (known after apply)
      + checksum                        = (known after apply)
      + child_directed                  = (known after apply)
      + created_date                    = (known after apply)
      + description                     = (known after apply)
      + detect_sentiment                = (known after apply)
      + enable_model_improvements       = (known after apply)
      + failure_reason                  = (known after apply)
      + id                              = (known after apply)
      + idle_session_ttl_in_seconds     = (known after apply)
      + last_updated_date               = (known after apply)
      + locale                          = (known after apply)
      + name                            = "BookTrip"
      + nlu_intent_confidence_threshold = (known after apply)
      + status                          = (known after apply)
      + version                         = (known after apply)
      + voice_id                        = (known after apply)
    }

  # data.aws_lex_bot_alias.book_trip_dev will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_bot_alias" "book_trip_dev"  {
      + arn               = (known after apply)
      + bot_name          = "BookTrip"
      + bot_version       = (known after apply)
      + checksum          = (known after apply)
      + created_date      = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "BookTripCalDev"
    }

  # data.aws_lex_intent.book_car will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_intent" "book_car"  {
      + arn                     = (known after apply)
      + checksum                = (known after apply)
      + created_date            = (known after apply)
      + description             = (known after apply)
      + id                      = (known after apply)
      + last_updated_date       = (known after apply)
      + name                    = "BookCar"
      + parent_intent_signature = (known after apply)
      + version                 = (known after apply)
    }

  # data.aws_lex_intent.book_hotel will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_intent" "book_hotel"  {
      + arn                     = (known after apply)
      + checksum                = (known after apply)
      + created_date            = (known after apply)
      + description             = (known after apply)
      + id                      = (known after apply)
      + last_updated_date       = (known after apply)
      + name                    = "BookHotel"
      + parent_intent_signature = (known after apply)
      + version                 = (known after apply)
    }

  # data.aws_lex_slot_type.car_types will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_slot_type" "car_types"  {
      + checksum                 = (known after apply)
      + created_date             = (known after apply)
      + description              = (known after apply)
      + enumeration_value        = (known after apply)
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "CarTypeValues"
      + value_selection_strategy = (known after apply)
      + version                  = (known after apply)
    }

  # data.aws_lex_slot_type.room_types will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lex_slot_type" "room_types"  {
      + checksum                 = (known after apply)
      + created_date             = (known after apply)
      + description              = (known after apply)
      + enumeration_value        = (known after apply)
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "RoomTypeValues"
      + value_selection_strategy = (known after apply)
      + version                  = (known after apply)
    }

  # aws_lex_bot.book_trip will be created
  + resource "aws_lex_bot" "book_trip" {
      + arn                             = (known after apply)
      + checksum                        = (known after apply)
      + child_directed                  = false
      + create_version                  = false
      + created_date                    = (known after apply)
      + description                     = "Bot to make reservations necessary for a visit to a city"
      + detect_sentiment                = false
      + enable_model_improvements       = false
      + failure_reason                  = (known after apply)
      + id                              = (known after apply)
      + idle_session_ttl_in_seconds     = 600
      + last_updated_date               = (known after apply)
      + locale                          = "en-US"
      + name                            = "BookTrip"
      + nlu_intent_confidence_threshold = 0
      + process_behavior                = "SAVE"
      + status                          = (known after apply)
      + version                         = (known after apply)
      + voice_id                        = "Salli"

      + abort_statement {
          + message {
              + content      = "Sorry, I am not able to assist at this time"
              + content_type = "PlainText"
            }
        }

      + clarification_prompt {
          + max_attempts = 2

          + message {
              + content      = "Sorry, what can I help you with?"
              + content_type = "PlainText"
            }
        }

      + intent {
          + intent_name    = "BookCar"
          + intent_version = (known after apply)
        }
      + intent {
          + intent_name    = "BookHotel"
          + intent_version = (known after apply)
        }
    }

  # aws_lex_bot_alias.book_trip_dev will be created
  + resource "aws_lex_bot_alias" "book_trip_dev" {
      + arn               = (known after apply)
      + bot_name          = "BookTrip"
      + bot_version       = (known after apply)
      + checksum          = (known after apply)
      + created_date      = (known after apply)
      + description       = "Development version of bot to make reservations necessary for a visit to a city"
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "BookTripCalDev"
    }

  # aws_lex_intent.book_car will be created
  + resource "aws_lex_intent" "book_car" {
      + arn               = (known after apply)
      + checksum          = (known after apply)
      + create_version    = false
      + created_date      = (known after apply)
      + description       = "Intent to book a car on StayBooker"
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "BookCar"
      + sample_utterances = [
          + "Book a car",
          + "Make a car reservation",
          + "Reserve a car",
        ]
      + version           = (known after apply)

      + confirmation_prompt {
          + max_attempts = 2

          + message {
              + content      = "Okay, I have you down for a {CarType} rental in {PickUpCity} from {PickUpDate} to {ReturnDate}.  Should I book the reservation?"
              + content_type = "PlainText"
            }
          + message {
              + content      = "The price of this {CarType} rental in {PickUpCity} from {PickUpDate} to {ReturnDate} is [currentReservationPrice] dollars.  Shall I book the reservation?"
              + content_type = "PlainText"
            }
        }

      + fulfillment_activity {
          + type = "ReturnIntent"
        }

      + rejection_statement {
          + message {
              + content      = "Okay, I have cancelled your reservation in progress."
              + content_type = "PlainText"
            }
        }

      + slot {
          + description       = "Age of the driver during the car rental."
          + name              = "DriverAge"
          + priority          = 4
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.NUMBER"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "How old is the driver for this rental?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "City in which the car reservation is being made"
          + name              = "PickUpCity"
          + priority          = 1
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.US_CITY"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "In what city do you need to rent a car?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Date of return.  Should be required when the flight is not one way."
          + name              = "ReturnDate"
          + priority          = 3
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.DATE"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What day do you want to return the car?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Date to start the rental"
          + name              = "PickUpDate"
          + priority          = 2
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.DATE"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What day do you want to start your rental?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Type of car being reserved."
          + name              = "CarType"
          + priority          = 5
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "CarTypeValues"
          + slot_type_version = (known after apply)

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What type of car would you like to rent?  Our most popular options are economy, midsize, and luxury"
                  + content_type = "PlainText"
                }
            }
        }
    }

  # aws_lex_intent.book_hotel will be created
  + resource "aws_lex_intent" "book_hotel" {
      + arn               = (known after apply)
      + checksum          = (known after apply)
      + create_version    = false
      + created_date      = (known after apply)
      + description       = "Intent to book a hotel on StayBooker"
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "BookHotel"
      + sample_utterances = [
          + "Book a hotel",
          + "Book a {Nights} night stay in {Location}",
          + "I want a make hotel reservations",
        ]
      + version           = (known after apply)

      + confirmation_prompt {
          + max_attempts = 2

          + message {
              + content      = "Okay, I have you down for a {Nights} night stay in {Location} starting {CheckInDate}.  Shall I book the reservation?"
              + content_type = "PlainText"
            }
          + message {
              + content      = "The price of this {Nights} night stay in {Location} from {CheckInDate} is [currentReservationPrice] dollars.  Shall I book the reservation?"
              + content_type = "PlainText"
            }
        }

      + fulfillment_activity {
          + type = "ReturnIntent"
        }

      + rejection_statement {
          + message {
              + content      = "Okay, I have cancelled your reservation in progress."
              + content_type = "PlainText"
            }
        }

      + slot {
          + description       = "Date of check-in"
          + name              = "CheckInDate"
          + priority          = 2
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.DATE"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What day do you want to check in?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Enumeration of types of rooms that are offered by a hotel."
          + name              = "RoomType"
          + priority          = 4
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "RoomTypeValues"
          + slot_type_version = (known after apply)

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What type of room would you like, queen, king or deluxe?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Location of the city in which the hotel is located"
          + name              = "Location"
          + priority          = 1
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.US_CITY"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "What city will you be staying in?"
                  + content_type = "PlainText"
                }
            }
        }
      + slot {
          + description       = "Number of nights in the hotel stay."
          + name              = "Nights"
          + priority          = 3
          + sample_utterances = []
          + slot_constraint   = "Required"
          + slot_type         = "AMAZON.NUMBER"

          + value_elicitation_prompt {
              + max_attempts = 2

              + message {
                  + content      = "How many nights will you be staying?"
                  + content_type = "PlainText"
                }
            }
        }
    }

  # aws_lex_slot_type.car_types will be created
  + resource "aws_lex_slot_type" "car_types" {
      + checksum                 = (known after apply)
      + create_version           = false
      + created_date             = (known after apply)
      + description              = "Enumeration representing possible types of cars available for rental"
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "CarTypeValues"
      + value_selection_strategy = "ORIGINAL_VALUE"
      + version                  = (known after apply)

      + enumeration_value {
          + synonyms = []
          + value    = "economy"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "full size"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "luxury"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "midsize"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "minivan"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "standard"
        }
    }

  # aws_lex_slot_type.room_types will be created
  + resource "aws_lex_slot_type" "room_types" {
      + checksum                 = (known after apply)
      + create_version           = false
      + created_date             = (known after apply)
      + description              = "Enumeration representing possible types of a hotel room"
      + id                       = (known after apply)
      + last_updated_date        = (known after apply)
      + name                     = "RoomTypeValues"
      + value_selection_strategy = "ORIGINAL_VALUE"
      + version                  = (known after apply)

      + enumeration_value {
          + synonyms = []
          + value    = "deluxe"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "king"
        }
      + enumeration_value {
          + synonyms = []
          + value    = "queen"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently  #run.`